# classification_acquire

## Hackney, Chad E.
### 27 Mar 19

## Exercises
### Data Acquisition & Summary

#### 1. Use the pydataset module to load the iris data set into a dataframe, df_iris

In [137]:
import seaborn as sns
import pandas as pd
from pydataset import data

In [138]:
import env

In [139]:
df_iris = data('iris')

In [140]:
print(df_iris.head(3))

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [141]:
df_iris.shape

(150, 5)

In [142]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

##### Below changes column names to lowers, AND replaces col name periods with underscores, "for columns in the df":

In [274]:
[col.lower().replace('.', '_') for col in df_iris]
df_iris.columns = [col.lower().replace('.', '_') for col in df_iris]

In [275]:
df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [160]:
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
Sepal.Length    150 non-null float64
Sepal.Width     150 non-null float64
Petal.Length    150 non-null float64
Petal.Width     150 non-null float64
Species         150 non-null object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [276]:
df_iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

##### Recommend rescaling this data, based on these statistics?

No, I would not recommend rescaling this data.  All in mms.  If in different measurement types, inches, feet, etc, then yes rescale.  If used for linear regression, then yes rescale.  Otherwise, not necessarily.

#### 2. Read the data tab from the stats module dataset, Excel_Stats.xlsx, into a dataframe, df_excel

In [ ]:
df_excel = pd.read_excel('Excel_Stats.xlsx', sheet_name=1)

Can grab excel worksheets by sheetname or by index number, see link below:
    https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

In [272]:
df_excel.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,tenure,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0017-IUDMW,Female,0,Yes,Yes,72,2,2,2,Credit card (automatic),116.80,8456.75,No
1,0019-EFAEP,Female,0,No,No,72,2,2,2,Bank transfer (automatic),101.30,7261.25,No
2,0078-XZMHT,Male,0,Yes,No,72,2,1,2,Bank transfer (automatic),85.15,6316.20,No

In [268]:
df_excel_sample = df_excel.head(100)

In [271]:
df_excel_sample.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,tenure,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0017-IUDMW,Female,0,Yes,Yes,72,2,2,2,Credit card (automatic),116.80,8456.75,No
1,0019-EFAEP,Female,0,No,No,72,2,2,2,Bank transfer (automatic),101.30,7261.25,No
2,0078-XZMHT,Male,0,Yes,No,72,2,1,2,Bank transfer (automatic),85.15,6316.20,No

In [167]:
df_excel.shape

(7043, 13)

In [168]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 13 columns):
customer_id          7043 non-null object
gender               7043 non-null object
is_senior_citizen    7043 non-null int64
partner              7043 non-null object
dependents           7043 non-null object
tenure               7043 non-null int64
phone_service        7043 non-null int64
internet_service     7043 non-null int64
contract_type        7043 non-null int64
payment_type         7043 non-null object
monthly_charges      7043 non-null float64
total_charges        7032 non-null float64
churn                7043 non-null object
dtypes: float64(2), int64(5), object(6)
memory usage: 715.4+ KB

In [171]:
df_excel.columns

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents',
       'tenure', 'phone_service', 'internet_service', 'contract_type',
       'payment_type', 'monthly_charges', 'total_charges', 'churn'],
      dtype='object')

In [183]:
df_excel.columns[0:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [187]:
df_excel.select_dtypes(include=['object']).columns

Index(['customer_id', 'gender', 'partner', 'dependents', 'payment_type',
       'churn'],
      dtype='object')

In [186]:
df_excel.select_dtypes(include=['number']).columns

Index(['is_senior_citizen', 'tenure', 'phone_service', 'internet_service',
       'contract_type', 'monthly_charges', 'total_charges'],
      dtype='object')

In [188]:
df_excel_2 = pd.DataFrame.select_dtypes(df_excel, include=object)
df_excel_2.head()

  customer_id  gender partner dependents               payment_type churn
0  0017-IUDMW  Female     Yes        Yes    Credit card (automatic)    No
1  0019-EFAEP  Female      No         No  Bank transfer (automatic)    No
2  0078-XZMHT    Male     Yes         No  Bank transfer (automatic)    No
3  0129-KPTWJ    Male     Yes         No           Electronic check    No
4  0164-APGRB  Female      No         No           Electronic check    No

In [189]:
df_excel_num = pd.DataFrame.select_dtypes(df_excel, exclude=object)
df_excel_num.describe()

,is_senior_citizen,tenure,phone_service,internet_service,contract_type,monthly_charges,total_charges
count,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7043.000000,7032.000000
mean,0.162147,32.371149,1.325004,1.222916,0.690473,64.761692,2283.300441
std,0.368612,24.559481,0.642730,0.778877,0.833755,30.090047,2266.771362
min,0.000000,0.000000,0.000000,0.000000,0.000000,18.250000,18.800000
25%,0.000000,9.000000,1.000000,1.000000,0.000000,35.500000,401.450000
50%,0.000000,29.000000,1.000000,1.000000,0.000000,70.350000,1397.475000
75%,0.000000,55.000000,2.000000,2.000000,1.000000,89.850000,3794.737500
max,1.000000,72.000000,2.000000,2.000000,2.000000,118.750000,8684.800000

In [191]:
df_excel_num_range = (df_excel_num.max() - df_excel_num.min())
df_excel_num_range

is_senior_citizen       1.0
tenure                 72.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

In [193]:
df_excel[df_excel.select_dtypes('number').columns].apply(lambda s: s.max() - s.min())

is_senior_citizen       1.0
tenure                 72.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

#### 3. Read train.csv from google drive (shared through classroom in topic 'Classification') into a dataframe labeled df_google

In [194]:
df_google = pd.read_csv('train.csv')

In [195]:
df_google.head(3)

,rowid,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
0,1,2015-02-04 17:51:00,23.18,27.2720,426.0,721.25,0.004793,1
1,2,2015-02-04 17:51:59,23.15,27.2675,429.5,714.00,0.004783,1
2,3,2015-02-04 17:53:00,23.15,27.2450,426.0,713.50,0.004779,1

In [178]:
df_google.shape

(8143, 8)

In [179]:
df_google.columns

Index(['rowid', 'date', 'Temperature', 'Humidity', 'Light', 'CO2',
       'HumidityRatio', 'Occupancy'],
      dtype='object')

In [180]:
df_google.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8143 entries, 0 to 8142
Data columns (total 8 columns):
rowid            8143 non-null int64
date             8143 non-null object
Temperature      8143 non-null float64
Humidity         8143 non-null float64
Light            8143 non-null float64
CO2              8143 non-null float64
HumidityRatio    8143 non-null float64
Occupancy        8143 non-null int64
dtypes: float64(5), int64(2), object(1)
memory usage: 509.0+ KB

In [181]:
df_google_2 = pd.DataFrame.select_dtypes(df_google, exclude=object)
df_google_2.describe()

,rowid,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
count,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000,8143.000000
mean,4072.000000,20.619084,25.731507,119.519375,606.546243,0.003863,0.212330
std,2350.825954,1.016916,5.531211,194.755805,314.320877,0.000852,0.408982
min,1.000000,19.000000,16.745000,0.000000,412.750000,0.002674,0.000000
25%,2036.500000,19.700000,20.200000,0.000000,439.000000,0.003078,0.000000
50%,4072.000000,20.390000,26.222500,0.000000,453.500000,0.003801,0.000000
75%,6107.500000,21.390000,30.533333,256.375000,638.833333,0.004352,0.000000
max,8143.000000,23.180000,39.117500,1546.333333,2028.500000,0.006476,1.000000

In [152]:
df_google_2 = pd.DataFrame.select_dtypes(df_google, include=object)
df_google_2.describe()

                       date
count                  8143
unique                 8143
top     2015-02-04 20:31:00
freq                      1

In [153]:
df_google.date.unique()

array(['2015-02-04 17:51:00', '2015-02-04 17:51:59',
       '2015-02-04 17:53:00', ..., '2015-02-10 09:30:59',
       '2015-02-10 09:32:00', '2015-02-10 09:33:00'], dtype=object)

In [196]:
df_google.Occupancy.unique()

array([1, 0])

# finish question #4

#### 4.  In mysql workbench or a terminal, write a query to select all the columns of the passengers table from the titanic database. Export that table to a csv you store locally. Read that csv into a dataframe df_csv.

In [217]:
db_url = f'mysql+pymysql://{env.user}:{env.password}@{env.host}/titanic_db'

In [218]:
df = pd.read_sql('select * from passengers', db_url)

In [ ]:
# df.to_csv('titanic.csv')

In [260]:
df_csv = pd.read_csv('titanic.csv')
ds_csv2 = df[(df_csv.columns[1:])].head(3)
ds_csv2

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

In [261]:
df.head(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1

In [262]:
df.tail(3)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
888,888,0,3,female,NaN,1,2,23.45,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.00,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.75,Q,Third,None,Queenstown,1

In [263]:
new_df = df.head(3)
new_df = new_df.append(df.tail(3))
new_df

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,None,Queenstown,1

In [225]:
df.shape

(891, 13)

In [232]:
df.columns

Index(['passenger_id', 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch',
       'fare', 'embarked', 'class', 'deck', 'embark_town', 'alone'],
      dtype='object')

In [265]:
df.dtypes

passenger_id      int64
survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class            object
deck             object
embark_town      object
alone             int64
dtype: object

In [235]:
df.describe()

,passenger_id,survived,pclass,age,sibsp,parch,fare,alone
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000,891.000000
mean,445.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208,0.602694
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429,0.489615
min,0.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,0.000000
25%,222.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400,0.000000
50%,445.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200,1.000000
75%,667.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000,1.000000
max,890.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200,1.000000

Print the unique values for one categorical variable.  The next cell below does the same for all categorical variables in the df.

In [205]:
df['class'].unique()

array(['Third', 'First', 'Second'], dtype=object)

print the unique values for each categorical variables. If there are more than 5 distince values, print the top 5 in terms of prevelence or frequency.

In [245]:
for col in df.select_dtypes(object):
    print(col, (df[col].unique()[:5]))

sex ['male' 'female']
embarked ['S' 'C' 'Q' None]
class ['Third' 'First' 'Second']
deck [None 'C' 'E' 'G' 'D']
embark_town ['Southampton' 'Cherbourg' 'Queenstown' None]

Below are three more examples of the code above, just done more fancy:

In [214]:
{col: df[col].unique()[:5] for col in df.select_dtypes(object)}

{'sex': array(['male', 'female'], dtype=object),
 'embarked': array(['S', 'C', 'Q', None], dtype=object),
 'class': array(['Third', 'First', 'Second'], dtype=object),
 'deck': array([None, 'C', 'E', 'G', 'D'], dtype=object),
 'embark_town': array(['Southampton', 'Cherbourg', 'Queenstown', None], dtype=object)}

In [215]:
{col: list(df[col].unique())[:5] for col in df.select_dtypes(object)}

{'sex': ['male', 'female'],
 'embarked': ['S', 'C', 'Q', None],
 'class': ['Third', 'First', 'Second'],
 'deck': [None, 'C', 'E', 'G', 'D'],
 'embark_town': ['Southampton', 'Cherbourg', 'Queenstown', None]}

In [212]:
cols = ["survived", "pclass", "sibsp", "parch", "embarked", "class", "deck", "alone"]
for col in cols:
    print(f"{col:>10}: {', '.join(pd.Series(df[col].value_counts().index.values).astype(str).unique()[:5])}")

  survived: 0, 1
    pclass: 3, 1, 2
     sibsp: 0, 1, 2, 4, 3
     parch: 0, 1, 2, 5, 3
  embarked: S, C, Q
     class: Third, First, Second
      deck: C, B, D, E, A
     alone: 1, 0

Below prints counts of instances/observations of each distinct categorical value in a discrete variable.

In [248]:
df.deck.value_counts()
# this operates like a "text histogram"

# while this *IS* helpful to see the counts of each of the distinct values in a variable,
# it's often a good idea to look at these individually to get a feel for the data.

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

Below groups or "bins" a continuous variable based on it's many values, and prints the counts of each of those bins.

In [208]:
df.fare.value_counts(bins=3)

(-0.513, 170.776]     871
(170.776, 341.553]     17
(341.553, 512.329]      3
Name: fare, dtype: int64